In [2]:
# Chapter 7; 데이터 정제 및 준비

In [3]:
# 이 장에서는 결측치, 중복 데이터, 문자열 처리 그리고 다른 분석적 데이터 변환에 대한 도구들을 다룬다.

In [4]:
# 다음 장에서는 데이터를 합치고 재배열하는 다양한 방법을 알아보겠다.

In [5]:
# 7.1 누락된 데이터 처리하기

In [6]:
# 누락된 데이터를 처리하는 일은 데이터 분석 애플리케이션에서 흔히 발생하는 일이다.

In [7]:
# pandas의 설계 목표 중 하나는 누락 데이터를 가능한 한 쉽게 처리할 수 있도록 하는 것이다.

In [8]:
# 예를 들어 pandas 객체의 모든 기술 통계는 누락된 데이터를 베제하고 처리한다.

In [9]:
# pandas 객체에서 누락된 값을 표현하는 방식은 완벽하다고 할 수 없다.

In [10]:
# 산술 데이터에 한해 pandas는 누락된 데이터를 실숫값인 NaN으로 취급한다.

In [11]:
# 이는 누락된 값을 쉽게 찾을 수 있도록 하는 파수병 역할을 한다.

In [12]:
import numpy as np
import pandas as pd
import sqlalchemy as sqla

In [13]:
string_data = pd.Series(["aardvark", "artichoke", np.nan, "avocado"])

In [14]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [15]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [16]:
# pandas에서는 R 프로그래밍 언어에서 결측치를 NA로 취급하는 개념을 차용했다.

In [17]:
# 여기서 결측값은 존재하지 않는(null) 값의 일종으로, 변수(variable) 등이며 값은 존재하는 것이지만, 그 시점에서 아직 정해져 있지 않은 값을 표시한다.

In [18]:
# 분석 애플리케이션에서 NA 데이터는 데이터가 존재하지 않거나, 존재하더라도 데이터를 수집하는 과정 등에서 검출되지 않았음을 의미한다.

In [19]:
# 분석을 위해 데이터를 정제하는 과정에서 결측치 자체를 데이터 수집 과정에서의 실수나 결측치로 인한 잠재적인 편향을 찾아내는 수단으로 인식하는 것은 중요하다.

In [20]:
# 파이썬의 내장 None 값 또한 NA 값으로 취급된다.

In [21]:
string_data[0] = None

In [22]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [23]:
# pandas 프로젝트에서는 결측치를 처리하는 방법을 개선하는 작업이 진행 중이지만 pandas.isnull 같은 사용자 API 함수에서는 성가신 부분을 추상화로 제거했다.

In [24]:
# [표 7-1]에 결측치 처리와 관련된 함수를 정리해두었다. [표 7-1] NA 처리 메서드 페이지 271쪽

In [25]:
# 7.1.1 누락된 데이터 골라내기

In [26]:
# 누락된 데이터를 골라내는 몇 가지 방법이 있는데, pandas.isnull이나 불리언 색인을 사용해 직접 손으로 제거하는 것도 한 가지 방법이다.

In [27]:
# 하지만 dropna를 매우 유용하게 사용할 수 있다.

In [28]:
# Series에 dropna 메서드를 적용하면 Null이 아닌 데이터와 색인값만 들어 있는 Series를 반환한다.

In [29]:
from numpy import nan as NA

In [30]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [31]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [32]:
# 위 코드는 다음과 동일하다.

In [33]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [34]:
# DataFrame 객체의 경우에는 조금 복잡한데, 모두 NA 값인 로우나 컬럼을 제외시키거나 NA 값을 하나라도 포함하고 있는 로우나 컬럼을 제외시킬 수 있다.

In [35]:
# dropna는 기본적으로 NA 값을 하나라도 포함하고 있는 로우를 제외시킨다.

In [36]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])

In [37]:
cleaned = data.dropna()

In [38]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [39]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [40]:
# how="all" 옵션을 넘기면 모두 NA 값인 로우만 제외시킨다.

In [41]:
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [42]:
# 컬럼을 제외시키는 방법도 동일하게 동작한다. 옵션으로 axis=1을 넘겨주면 된다.

In [43]:
data[4] = NA

In [44]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [45]:
data.dropna(axis=1, how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [46]:
# DataFrame의 로우를 제외시키는 방법은 시계열 데이터에 주로 사용되는 경향이 있다.

In [47]:
# 몇 개 이상의 값이 들어 있는 로우만 살펴보고 싶다면 thresh 인자에 원하는 값을 넘기면 된다.

In [48]:
df = pd.DataFrame(np.random.randn(7, 3))

In [49]:
df.iloc[:4, 1] = NA

In [50]:
df.iloc[:2, 2] = NA

In [51]:
df

          0         1         2
0  2.252368       NaN       NaN
1 -0.171580       NaN       NaN
2 -1.048342       NaN  1.494663
3  0.105529       NaN  1.670052
4  1.020877 -1.116029  0.710855
5 -2.449315 -0.049945  0.203584
6  0.795815 -0.214871  0.526671

In [52]:
df.dropna()

          0         1         2
4  1.020877 -1.116029  0.710855
5 -2.449315 -0.049945  0.203584
6  0.795815 -0.214871  0.526671

In [53]:
df.dropna(thresh=2)

          0         1         2
2 -1.048342       NaN  1.494663
3  0.105529       NaN  1.670052
4  1.020877 -1.116029  0.710855
5 -2.449315 -0.049945  0.203584
6  0.795815 -0.214871  0.526671

In [54]:
# 7.1.2 결측치 채우기

In [55]:
# 누락된 값을 제외시키지 않고(잠재적으로 다른 데이터도 함께 버려질 가능성이 있다) 데이터 상의 "구멍"을 어떻게든 메우고 싶은 경향이 있다.

In [56]:
# 이 경우 fillna 메서드를 활용하면 되는데, fillna 메서드에 채워 넣고 싶은 값을 넘겨주면 된다.

In [57]:
df.fillna(0)

          0         1         2
0  2.252368  0.000000  0.000000
1 -0.171580  0.000000  0.000000
2 -1.048342  0.000000  1.494663
3  0.105529  0.000000  1.670052
4  1.020877 -1.116029  0.710855
5 -2.449315 -0.049945  0.203584
6  0.795815 -0.214871  0.526671

In [58]:
# fillna에 사전값을 넘겨서 각 컬럼마다 다른 값을 채울 수도 있다.

In [59]:
df.fillna({1:0.5, 2: 0})

          0         1         2
0  2.252368  0.500000  0.000000
1 -0.171580  0.500000  0.000000
2 -1.048342  0.500000  1.494663
3  0.105529  0.500000  1.670052
4  1.020877 -1.116029  0.710855
5 -2.449315 -0.049945  0.203584
6  0.795815 -0.214871  0.526671

In [60]:
# fillna는 새로운 객체를 반환하지만 다음처럼 기존 객체를 변경할 수도 있다.

In [61]:
_ = df.fillna(0, inplace=True)

In [62]:
df

          0         1         2
0  2.252368  0.000000  0.000000
1 -0.171580  0.000000  0.000000
2 -1.048342  0.000000  1.494663
3  0.105529  0.000000  1.670052
4  1.020877 -1.116029  0.710855
5 -2.449315 -0.049945  0.203584
6  0.795815 -0.214871  0.526671

In [63]:
# 재색인에서 사용 가능한 보간 메서드는 fillna 메서드에서도 사용가능하다.

In [64]:
df = pd.DataFrame(np.random.randn(6, 3))

In [65]:
df.iloc[2:, 1] = NA

In [66]:
df.iloc[4:, 2] = NA

In [67]:
df

          0         1         2
0  0.696236 -1.006784  0.115890
1 -0.283593 -1.276299 -0.508690
2  0.324589       NaN  0.185837
3 -1.252009       NaN  0.766735
4  0.905385       NaN       NaN
5  0.490021       NaN       NaN

In [68]:
df.fillna(method="ffill")

          0         1         2
0  0.696236 -1.006784  0.115890
1 -0.283593 -1.276299 -0.508690
2  0.324589 -1.276299  0.185837
3 -1.252009 -1.276299  0.766735
4  0.905385 -1.276299  0.766735
5  0.490021 -1.276299  0.766735

In [69]:
df.fillna(method="ffill", limit=2)

          0         1         2
0  0.696236 -1.006784  0.115890
1 -0.283593 -1.276299 -0.508690
2  0.324589 -1.276299  0.185837
3 -1.252009 -1.276299  0.766735
4  0.905385       NaN  0.766735
5  0.490021       NaN  0.766735

In [70]:
# 조금만 창의적으로 생각하면 fillna를 이용해서 매우 다양한 일을 할 수 있는데 예를 들어 Series의 평균값이나 중간값을 전달할 수도 있다.

In [71]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [72]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [73]:
# fillna에 대한 설명은 [표 7-2]를 참조하자. [표 7-2] fillna 함수 인자 - 페이지 276

In [74]:
# 7.2 데이터 변형

In [75]:
# 지금까지 데이터를 재배치하는 방법을 알아봤다. 필터링, 정제 및 다른 변형 역시 중요한 연산이다.

In [76]:
# 7.2.1 중복 제거하기

In [77]:
# 여러 가지 이유로 DataFrame에서 중복된 로우를 발견할 수 있다. 예제를 보자.

In [78]:
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"],
                     "k2" : [1, 1, 2, 3, 3, 4, 4]})

In [79]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [80]:
# DataFrame의 duplicated 메서드는 각 로우가 중복인지 아닌지 알려주는 불리언 Series를 반환한다.

In [81]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [82]:
# drop_duplicates는 duplicated 배열이 False인 DataFrame을 반환한다.

In [83]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [84]:
# 이 두 메서드는 기본적으로 모든 컬럼에 적용되며 중복을 찾아내기 위한 부분합을 따로 지정해줄 수도 있다.

In [85]:
# 새로운 컬럼을 하나 추가하고 "k1" 컬럼에 기반해서 중복을 걸러내려면 다음과 같이 한다.

In [86]:
data["v1"] = range(7)

In [87]:
data.drop_duplicates(["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [88]:
# duplicated와 drop_duplicates는 기본적으로 처음 발견된 값을 유지한다.

In [89]:
# keep="last" 옵션을 넘기면 마지막으로 발견된 값을 반환한다.

In [90]:
data.drop_duplicates(["k1", "k2"], keep="last")

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [91]:
# 7.2.2 함수나 매핑을 이용해서 데이터 변형하기

In [92]:
# 데이터를 다루다 보면 DataFrame의 컬럼이나 Series, 배열 내의 값을 기반으로 데이터의 형태를 변환하고 싶은 경우가 있다.

In [93]:
# 가상으로 수집한 육류에 대한 다음 정보를 한번 살펴보자.

In [94]:
data = pd.DataFrame({"food" : ["bacon", "pulled pork", "bacon",
                               "Pastrami", "corned beef", "Bacon",
                               "pastrami", "honey ham", "nova lox"],
                     "ounces" : [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [95]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [96]:
# 그리고 해당 육류가 어떤 동물의 고기인지 알려줄 수 있는 컬럼을 하나 추가한다고 가정하고 육류별 동물을 담고 있는 사전 데이터를 아래처럼 작성하자.

In [97]:
meat_to_animal = {
    "bacon": "pig",
    "pulled pork": "pig",
    "pastrami": "cow", 
    "corned beef": "cow",
    "honey ham": "pig",
    "nova lox": "salmon" 
}

In [98]:
# Series의 map 메서드는 사전류의 객체나 어떤 함수를 받을 수 있는데, 위 데이터에는 육류 이름에 대소문자가 섞여 있는 사소한 문제가 있으므로 
# str.lower 메서드를 사용해서 모두 소문자로 변경한다.

In [99]:
lowercased = data["food"].str.lower()

In [100]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [101]:
data["animal"] = lowercased.map(meat_to_animal)

In [102]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [103]:
# 물론 함수를 넘겨서 같은 일을 수행할 수도 있다.

In [104]:
data["food"].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [105]:
# map 메서드를 사용하면 데이터의 요소별 변환 및 데이터를 다듬는 작업을 편리하게 수행할 수 있다.

In [106]:
# 7.2.3 값 치환하기

In [107]:
# fillna 메서드를 사용해서 누락된 값을 채우는 일은 일반적인 값 치환 작업이라고 볼 수 있다.

In [108]:
# 위에서 살펴봤듯이 map 메서드를 한 객체 안에서 값의 부분집합을 변경하는 데 사용했다면 replace 메서드는 같은 작업에 대해 좀 더 간단하고 유연한 방법을 제공한다.

In [109]:
# 다음 Series 객체를 살펴보자.

In [110]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [111]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [112]:
# -999는 누락된 데이터를 나타내기 위한 값이다.

In [113]:
# replace 메서드를 이용하면 이 값을 pandas에서 인식할 수 있는 NA 값으로 치환한 새로운 Series를 생성할 수 있다. 인자로 inplace=True를 넘기지 않았다면

In [114]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [115]:
# 여러 개의 값을 한 번에 치환하려면 하나의 값 대신 치환하려는 값의 리스트를 넘기면 된다.

In [116]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [117]:
# 치환하려는 값마다 다른 값으로 치환하려면 누락된 값 대신 리스트를 사용하면 된다.

In [118]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [119]:
# 두 개의 리스트 대신 사전을 이용하는 것도 가능하다.

In [120]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [121]:
# Note: data.replace 메서드는 문자열 치환을 항목 단위로 수행하는 data.str.replace와 구별되는데 자세한 내용은 나중에 Series의 문자열 메서드와 함께 알아보겠다.

In [122]:
# 7.2.4 축 색인 이름 바꾸기

In [123]:
# Series의 값들처럼 축 이름 역시 유사한 방식으로 함수나 새롭게 바꿀 값을 이용해서 변환할 수 있다.

In [124]:
# 새로운 자료구조를 만들지 않고 그 자리에서 바로 축 이름을 변경하는 것이 가능하다.

In [125]:
# 다음 예제를 살펴보자.

In [126]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=["Ohio", "Colorado", "New York"],
                    columns=["one", "two", "three", "four"])

In [127]:
# Series와 마찬가지로 축 색인에도 map 메서드가 있다.

In [128]:
transform = lambda x: x[:4].upper()

In [129]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [130]:
# 대문자로 변경된 축 이름을 DataFrame의 index에 바로 대입할 수 있다.

In [131]:
data.index = data.index.map(transform)

In [132]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [133]:
# 원래 객체를 변경하지 않고 새로운 객체를 생성하려면 rename 메서드를 사용한다.

In [134]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [135]:
# 특히 rename 메서드는 사전 형식의 객체를 이용해서 축 이름 중 일부만 변경하는 것도 가능하다.

In [136]:
data.rename(index={"OHIO": "INDIANA"},
            columns={"three": "peekaboo"})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [137]:
# rename 메서드를 사용하면 DataFrame을 직접 복사해서 index와 columns 속성을 갱신할 필요 없이 바로 변경할 수 있다.

In [138]:
# 원본 데이터를 바로 변경하려면 inplace=True 옵션을 넘겨주면 된다.

In [139]:
data.rename(index={"OHIO": "INDIANA"}, inplace=True)

In [140]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [141]:
# 7.2.5 개별화와 양자화

In [142]:
# 연속성 데이터는 종종 개별로 분할하거나 아니면 분석을 위해 그룹별로 나누기도 하는데, 수업에 참여하는 학생 그룹 데이터가 있고, 나이대에 따라 분류한다고 가정하자.

In [143]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [144]:
# 이 데이터를 pandas의 cut 함수를 이용해서 18-25, 26-35, 35-60, 60 이상 그룹으로 나누어보자.

In [145]:
bins = [18, 25, 35, 60, 100]

In [146]:
cats = pd.cut(ages, bins)

In [147]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [148]:
# pandas에서 반환하는 객체는 Categorical이라는 특수한 객체다. 결과에서 보이는 그룹은 pandas.cut으로 계산된 것이다.

In [149]:
# 이 객체는 그룹 이름이 담긴 배열이라고 생각하면 된다.

In [150]:
# 이 Categorical 객체는 codes 속성에 있는 ages 데이터에 대한 카테고리 이름을 categories라는 배열에 내부적으로 담고 있다.

In [151]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [152]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [153]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [154]:
# pd.value_counts(cats)는 pandas.cut 결과에 대한 그룹 수다.

In [155]:
# 간격을 나타내는 표기법은 중괄호로 시작해서 대괄호로 끝나는데 "중괄호 쪽의 값은 포함되지 않고 대괄호 쪽의 값은 포함"하는 간격을 나타낸다.

In [156]:
# right=False를 넘겨서 중괄호 대신 대괄호 쪽이 포함되지 않도록 바꿀 수 있다.

In [157]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64, left]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [158]:
# labels 옵션으로 그룹의 이름을 직접 넘겨줄 수도 있다.

In [159]:
groups_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]

In [160]:
pd.cut(ages, bins, labels=groups_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [161]:
# 만약 cut 함수에 명시적으로 그룹의 경곗값을 넘기지 않고 그룹의 개수를 넘겨주면 데이터에서 최솟값과 최댓값을 기준으로 균등한 길이의 그룹을 자동으로 계산한다.

In [162]:
# 어떤 균등분포 내에서 4개의 그룹으로 나누는 경우를 생각해보자.

In [163]:
data = np.random.rand(20)

In [164]:
pd.cut(data, 4, precision=2)

[(0.51, 0.73], (0.51, 0.73], (0.51, 0.73], (0.51, 0.73], (0.73, 0.96], ..., (0.28, 0.51], (0.28, 0.51], (0.052, 0.28], (0.28, 0.51], (0.28, 0.51]]
Length: 20
Categories (4, interval[float64, right]): [(0.052, 0.28] < (0.28, 0.51] < (0.51, 0.73] < (0.73, 0.96]]

In [165]:
# precision=2 옵션은 소수점 아래 2자리까지로 제한한다.

In [166]:
# 이를 위한 가장 적합한 함수로 qcut이 있는데 표본 변위치를 기반으로 데이터를 나눠준다.

In [167]:
# cut 함수를 사용하면 데이터의 분산에 따라 각각의 그룹마다 데이터 수가 다르게 나뉘는 경우가 많다.

In [168]:
# qcut은 표준 변위치를 사용하기 때문에 적당히 같은 크기의 그룹으로 나눌 수 있다.

In [169]:
data = np.random.randn(1000) # 정규 분포

In [170]:
cats = pd.qcut(data, 4)

In [171]:
cats

[(0.714, 2.904], (-3.1189999999999998, -0.664], (-0.664, 0.0269], (-3.1189999999999998, -0.664], (-0.664, 0.0269], ..., (0.0269, 0.714], (0.714, 2.904], (0.714, 2.904], (0.714, 2.904], (0.714, 2.904]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.1189999999999998, -0.664] < (-0.664, 0.0269] < (0.0269, 0.714] < (0.714, 2.904]]

In [172]:
pd.value_counts(cats)

(-3.1189999999999998, -0.664]    250
(-0.664, 0.0269]                 250
(0.0269, 0.714]                  250
(0.714, 2.904]                   250
dtype: int64

In [173]:
# cut 함수와 유사하게 변위치를 직접 지정해줄 수 있다(변위치는 0부터 1까지다).

In [174]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(0.0269, 1.3], (-3.1189999999999998, -1.216], (-1.216, 0.0269], (-1.216, 0.0269], (-1.216, 0.0269], ..., (0.0269, 1.3], (1.3, 2.904], (1.3, 2.904], (1.3, 2.904], (0.0269, 1.3]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.1189999999999998, -1.216] < (-1.216, 0.0269] < (0.0269, 1.3] < (1.3, 2.904]]

In [175]:
# 그룹 분석과 변위치를 다룰 때는 cut과 qcut 함수 같은 이산함수가 특히 더 유용한데 이 내용은 수집과 그룹 연산을 다루는 10장에서 다시 한번 살펴보도록 하겠다.

In [176]:
# 7.2.6 특잇값을 찾고 제외하기

In [177]:
# 배열 연산을 수행할 때는 특잇값을 제외하거나 적당한 값으로 대체하는 것이 중요하다.

In [178]:
# 적절히 분산된 값이 담겨 있는 DataFrame을 살펴보자.

In [179]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [180]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.028990     0.003492     0.040873    -0.042656
std       0.984007     0.995156     1.013820     1.001168
min      -3.663067    -2.907024    -3.121872    -3.292704
25%      -0.699163    -0.648775    -0.641568    -0.723387
50%      -0.001619    -0.042278     0.029341    -0.051588
75%       0.648397     0.671367     0.720629     0.612133
max       3.237943     3.165228     2.852915     3.430361

In [181]:
# 이 DataFrame의 한 컬럼에서 절댓값이 3을 초과하는 값을 찾아내자.

In [182]:
col = data[2]

In [183]:
col[np.abs(col) > 3]

978   -3.121872
Name: 2, dtype: float64

In [184]:
# 절댓값이 3을 초과하는 값이 들어 있는 모든 로우를 선택하려면 불리언 DataFrame에서 any 메서드를 사용하면 된다.

In [185]:
data[(np.abs(data) > 3).any(1)]

C:\Users\ahnjh\AppData\Local\Temp\ipykernel_27860\2969116195.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.any and Series.any will be keyword-only.
  data[(np.abs(data) > 3).any(1)]

            0         1         2         3
15   1.599223  0.291366  0.604296  3.135510
355 -2.040121 -0.204748  0.470449  3.430361
534  0.518598  0.580140  1.633532  3.001186
553  3.237943 -0.126800 -0.264656 -0.472813
620  1.154441  3.165228 -1.021218 -0.374280
693 -3.168915 -0.288698 -0.216556 -0.459960
756 -3.663067 -0.574600  0.764095 -0.460448
856  0.426990  0.087573 -1.074265  3.353719
917  0.253188  0.556653 -1.538696 -3.292704
978 -1.218526  1.106427 -3.121872 -0.097942

In [186]:
# 이 기준대로 쉽게 값을 선택할 수 있으며, 아래 코드로 -3이나 3을 초과하는 값을 -3 또는 3으로 지정할 수 있다.

In [187]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [188]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.028396     0.003326     0.040995    -0.043284
std       0.980486     0.994644     1.013447     0.997287
min      -3.000000    -2.907024    -3.000000    -3.000000
25%      -0.699163    -0.648775    -0.641568    -0.723387
50%      -0.001619    -0.042278     0.029341    -0.051588
75%       0.648397     0.671367     0.720629     0.612133
max       3.000000     3.000000     2.852915     3.000000

In [189]:
# np.sign(data)는 data 값이 양수인지 음수인지에 따라 1이나 -1이 담긴 배열을 반환한다.

In [190]:
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0 -1.0  1.0
1  1.0  1.0  1.0 -1.0
2 -1.0 -1.0  1.0 -1.0
3 -1.0  1.0  1.0 -1.0
4 -1.0 -1.0 -1.0 -1.0

In [191]:
# 7.2.7 치환과 임의 샘플링

In [192]:
# numpy.random.permutaion 함수를 이용하면 Series나 DataFrame의 로우를 쉽게 임의 순서로 재배치할 수 있다.

In [193]:
# 순서를 바꾸고 싶은 만큼의 길이를 permutaion 함수로 넘기면 바뀐 순서가 담긴 정수 배열이 생성된다.

In [194]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [195]:
sampler = np.random.permutation(5)

In [196]:
sampler

array([3, 4, 2, 0, 1])

In [197]:
# 이 배열은 iloc 기반의 색인이나 take 함수에서 사용 가능하다.

In [198]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [199]:
df.take(sampler)

    0   1   2   3
3  12  13  14  15
4  16  17  18  19
2   8   9  10  11
0   0   1   2   3
1   4   5   6   7

In [200]:
# 치환 없이 일부만 임의로 선택하려면 Series나 DataFrame의 sample 메서드를 사용하면 된다.

In [201]:
df.sample(n=3)

    0   1   2   3
3  12  13  14  15
0   0   1   2   3
1   4   5   6   7

In [202]:
# (반복 선택을 허용하며) 표본을 치환을 통해 생성해내려면 sample에 replace=True 옵션을 넘긴다.

In [203]:
choices = pd.Series([5, 7, -1, 6, 4])

In [204]:
draws = choices.sample(n=10, replace=True)

In [205]:
draws

4    4
0    5
1    7
2   -1
0    5
3    6
1    7
3    6
2   -1
1    7
dtype: int64

In [206]:
# 7.2.8 표시자/더미 변수 계산하기

In [207]:
# 통계 모델이나 머신 러닝 애플리케이션을 위한 또 다른 데이터 변환은 분류값을 "더미"나 "표시자" 행렬로 전환하는 것이다.

In [208]:
# 만약 어떤 DataFrame의 한 컬럼에 k가지 값이 있다면 k개의 컬럼이 있는 DataFrame이나 행렬을 만들고 값으로는 1과 0을 채워 넣을 것이다.

In [209]:
# pandas의 get_dummies가 이를 위한 함수인데 학습자 스스로 새로운 방법을 고안해내는 것도 어렵지 않을 것이다.

In [210]:
# 앞서 살펴본 DataFrame을 다시 살펴보자.

In [211]:
df = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "b"],
                   "data1": range(6)})

In [212]:
pd.get_dummies(df["key"])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [213]:
# 표시자 DataFrame 안에 있는 컬럼에 접두어를 추가한 후 다른 데이터와 병합하고 싶을 경우가 있다.

In [214]:
# get_dummies 함수의 prefix(접두어) 인자를 사용하면 이를 수행할 수 있다.

In [215]:
dummies = pd.get_dummies(df["key"], prefix="key")

In [216]:
df_with_dummy = df[["data1"]].join(dummies)

In [217]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [218]:
# DataFrame의 한 로우가 여러 카테고리에 속한다면 조금 복잡해지는데, 자세한 내용은 14.2절 "MovieLens의 영화 평점 데이터"에서 살펴보자.

In [219]:
# 우선은 각주 처리하고, 14장이 되면 그때 다시 코드를 적어보겠다.

In [220]:
# names = ["movie_id", "title", "genres"]

In [221]:
# movies = pd.read_table("datasets/movielens/movies.dat", sep="::",
#                         header=None, names=mnames)

In [222]:
# movies[:10]

In [223]:
# 각 장르마다 표시자 값을 추가하려면 약간의 수고를 해야 하는데 먼저 데이터 묶음에서 유일한 장르 목록을 추출해야 한다.

In [224]:
# all_genres = []

In [225]:
# for x in movies.genres:
#   all_genres.extend(x.split("|"))

In [226]:
# genres = pd.unique(all_genres)

In [227]:
# 이제 장르는 아래와 같은 모양이 된다.

In [228]:
# genres

In [229]:
# 이제 표시자 DataFrame을 생성하기 위해 0으로 초기화된 DataFrame을 생성하자.

In [230]:
# zero_matrix = np.zeros((len(movies), len(genres)))

In [231]:
# dummies = pd.DataFrame(zero_matrix, columns=genres)

In [232]:
# 각 영화를 순회하면서 dummies의 각 로우의 항목을 1로 설정한다.

In [233]:
# 각 장르의 컬럼 색인을 계산하기 위해 dummies.columns를 사용하자.

In [234]:
# gen = movies.genres[0]

In [235]:
# gen.split("|")

In [236]:
# dummies.columns.get_indexer(gen.split("|"))

In [237]:
# 그리고 .iloc를 이용해서 색인에 맞게 값을 대입하자.

In [238]:
# for i, gen in enumerate(movies.genres):
#   indices = dummies.columns.get_indexer(gen.split("|"))
#   dummies.iloc[i, indices] = 1

In [239]:
# 그리고 앞에서 한 것처럼 movies와 조합하면 된다.

In [240]:
# movies_windic = movies.join(dummies.add_prefix("Genre_"))

In [241]:
# movies_windic.iloc[0]

In [242]:
# Note : 이보다 더 큰 데이터라면 이 방법으로 다중 멤버십을 갖는 표시자 변수를 생성하는 것은 그다지 빠른 방법은 아니다. 
# 속도를 높이려면 직접 NumPy 배열에 접근하는 저수준의 함수를 작성해서 DataFrame에 결과를 저장하도록 해야 한다.

In [243]:
# get_dummies와 cut 같은 이산함수를 잘 조합하면 통계 애플리케이션에서 유용하게 사용할 수 있다.

In [244]:
np.random.seed(12345)

In [245]:
values = np.random.rand(10)

In [246]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [247]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [248]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [249]:
# 여기서는 예제 값이 불변하도록 numpy.random.seed 함수를 이용해서 난수 시드값을 지정했다.

In [250]:
# pandas.get_dummies 함수는 나중에 다시 살펴볼 것이다.

In [251]:
# 7.3 문자열 다루기

In [252]:
# 파이썬은 문자열이나 텍스트 처리의 용이함 덕분에 원시 데이터를 처리하는 인기 있는 언어가 되었다.

In [253]:
# 대부분의 텍스트 연산은 문자열 객체의 내장 메서드로 간단하게 처리할 수 있다.

In [254]:
# 좀 더 복잡한 패턴 매칭이나 텍스트 조작은 정규 표현식을 필요로 한다.

In [255]:
# pandas는 배열 데이터 전체에 쉽게 정규 표현식을 적용하고, 누락된 데이터를 편리하게 처리할 수 있는 기능을 포함하고 있다.

In [256]:
# 7.3.1 문자열 객체 메서드

In [257]:
# 문자열을 다뤄야 하는 대부분의 애플리케이션은 내장 문자열 메서드만으로도 충분하다.

In [258]:
# 예를 들어 쉼표로 구분된 문자열은 split 메서드를 이용해서 분리할 수 있다.

In [259]:
val = "a, b, guido"

In [260]:
val.split(",")

['a', ' b', ' guido']

In [261]:
# split 메서드는 종종 공백 문자(줄바꿈 문자 포함)를 제거하는 strip 메서드와 조합해서 사용하기도 한다.

In [262]:
pieces = [x.strip() for x in val.split(",")]

In [263]:
pieces

['a', 'b', 'guido']

In [264]:
# 이렇게 분리된 문자열은 더하기 연산을 사용해서 :: 문자열과 합칠 수도 있다.

In [265]:
first, second, third = pieces

In [266]:
first + "::" + second + "::" + third

'a::b::guido'

In [267]:
# 하지만 이 방법은 실용적이면서 범용적인 메서드는 아니다. 빠르고 좀 더 파이썬스러운 방법은 리스트나 튜플을 :: 문자열의 join 메서드로 전달하는 것이다.

In [268]:
"::".join(pieces) # 좀 더 효율적인 코드

'a::b::guido'

In [269]:
# 일치하는 부분문자열의 위치를 찾는 방법도 있다. index나 find를 사용하는 것도 가능하지만 파이썬의 in 예약어를 사용하면 일치하는 부분문자열을 쉽게 찾을 수 있다.

In [270]:
"guido" in val

True

In [271]:
val.index(",")

1

In [272]:
val.find(":")

-1

In [273]:
# find와 index의 차이점은 index의 경우 문자열을 찾지 못하면 예외를 발생시킨다는 것이다.

In [274]:
# find의 경우에는 -1을 반환한다.

In [275]:
val.index(":") # ValueError 발생

ValueError: substring not found

In [276]:
# count는 특정 부분문자열이 몇 건 발견되었는지 반환한다.

In [277]:
val.count(",")

2

In [278]:
# replace는 찾아낸 패턴을 다른 문자열로 치환한다.

In [279]:
# 이 메서드는 대체할 문자열로 비어 있는 문자열을 넘겨서 패턴을 삭제하기 위한 방법으로 자주 사용되기도 한다.

In [280]:
val.replace(",", "::")

'a:: b:: guido'

In [281]:
val.replace(",", "")

'a b guido'

In [282]:
# [표7-3]에 파이썬의 문자열 함수를 모아두었다. 페이지 298쪽

In [283]:
# 정규 표현식을 이런 다양한 용도로 사용할 수 있다.

In [284]:
# 7.3.2 정규 표현식

In [285]:
# 정규 표현식은 텍스트에서 문자열 패턴을 찾는 유연한 방법을 제공한다. 흔히 regex라 불리는 단일 표현식은 정규 표현 언어로 구성된 문자열이다.

In [286]:
# 파이썬에는 re 모듈이 내장되어 있어서 문자열에 대한 정규 표현식을 처리한다. 몇 가지 예제로 알아보자

In [287]:
# NOTE_ 정규 표현식을 작성하는 방법은 그 자체로 하나의 독립된 장으로 구성할 수 있고 따라서 이 책에서 다루는 범위를 벗어난다. 
# 정규 표현식에 관한 많은 튜토리얼과 레퍼런스가 존재한다.

In [288]:
# re 모듈 함수는 패턴 매칭, 치환, 분리, 세 가지로 나눌 수 있다. 물론 이 세 가지는 모두 서로 연관되어 있다.

In [289]:
# 정규 표현식은 텍스트 내에 존재하는 패턴을 표현하고 이를 여러 가지 다양한 목적으로 사용할 수 있도록 되어 있다.

In [290]:
# 간단한 예제를 살펴보자. 여러가지 공백 문자(탭, 스페이스, 개행 문자)가 포함된 문자열을 나누고 싶다면 하나 이상의 공백 문자를 의미하는 \s+를 사용해서 문자열을 분리한다.

In [291]:
import re

In [292]:
text = "foo bar\t baz \tqux"

In [293]:
re.split("\s+", text)

['foo', 'bar', 'baz', 'qux']

In [294]:
# re.split("\s+", text)를 사용하면 먼저 정규 표현식이 컴파일 되고 그 다음에 split 메서드가 실행된다.

In [295]:
# re.compile로 직접 정규 표현식을 컴파일하고 그렇게 얻은 정규 표현식 객체를 재사용하는 것도 가능하다.

In [296]:
regex = re.compile("\s+")

In [297]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [298]:
# 정규 표현식에 매칭되는 모든 패턴의 목록을 얻고 싶다면 findall 메서드를 사용한다.

In [299]:
regex.findall(text)

[' ', '\t ', ' \t']

In [300]:
# NOTE_ 정규 표현식에서 \ 문자가 이스케이프되는 문제를 피하려면 raw 문자열 표기법을 사용한다. 
# 그러면 \를 이스케이프 문자로 처리하지 않고 일반 문자로 처리하기 때문에 \를 간단하게 표현할 수 있다. 
# 즉, "C:\\x" 대신 r"C:\x"를 사용한다.

In [301]:
# 같은 정규 표현식을 다른 문자열에도 적용해야 한다면 re.compile을 이용해서 정규 표현식 객체를 만들어 쓰는 방법을 추천한다.

In [302]:
# 이렇게 하면 CPU 사용량을 아낄 수 있다.

In [303]:
# match와 search는 findall 메서드와 관련이 있다. findall은 문자열에서 일치하는 모든 부분문자열을 찾아주지만 search 메서드는 패턴과 일치하는 첫 번째 존재를 반환한다.

In [304]:
# match 메서드는 이보다 더 엄격해서 문자열의 시작부분에서 일치하는 것만 찾아준다. 약간 복잡한 예제로 이메일 주소를 검사하는 정규 표현식을 한 번 살펴보자.

In [305]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

# re.IGNORECASE는 정규 표현식이 대소문자를 가리지 않도록 한다. 
regex = re.compile(pattern, flags=re.IGNORECASE)

In [306]:
# findall 메서드를 사용해서 이메일 주소의 리스트를 생성하자.

In [307]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [308]:
# search는 텍스트에서 첫 번째 이메일 주소만을 찾아준다.

In [309]:
# 위 정규 표현식에 대한 match 객체는 그 정규 표현 패턴이 문자열 내에서 위치하는 시작점과 끝점만을 알려준다.

In [310]:
m = regex.search(text)

In [311]:
m

In [312]:
text[m.start():m.end()]

'dave@google.com'

In [313]:
# regex.match는 None을 반환한다. 왜냐하면 그 정규 표현 패턴이 문자열의 시작점에서부터 일치하는지 검사하기 때문이다.

In [314]:
print(regex.match(text))

None

In [315]:
# sub 메서드는 찾은 패턴을 주어진 문자열로 치환하여 새로운 문자열을 반환한다.

In [316]:
print(regex.sub("REDACTED", text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [317]:
# 이메일 주소를 찾아서 동시에 각 이메일 주소를 사용자 이름, 도메인 이름, 도메인 접미사 세가지 컴포넌트로 나눠야한다면 각 패턴을 괄호로 묶어준다.

In [318]:
pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})"

In [319]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [320]:
# 이렇게 만든 match 객체를 이용하면 group 메서드로 각 패턴 컴포넌트의 튜플을 얻을 수 있다.

In [321]:
m = regex.match("wesm@bright.net")

In [322]:
m.groups() # AttributeError가 발생하여 저자의 깃허브를 참조했다.

('wesm', 'bright', 'net')

In [323]:
# 패턴에 그룹이 존재한다면 findall 메서드는 튜플의 목록을 반환한다.

In [324]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [325]:
# sub 역시 마찬가지로 \1, \2 같은 특수한 기호를 사용해서 각 패턴 그룹에 접근할 수 있다. \1은 첫 번째로 찾은 그룹을 의미하고, \2는 두 번째로 찾은 그룹을 의미한다.

In [326]:
print(regex.sub(r"Username: \1, Domain: \2, Suffix: \3", text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

In [327]:
# 이 밖에도 파이썬에서 할 수 있는 정규 표현식은 많이 있지만 대부분 이 책의 범위를 벗어난다. 표 [7-4]에 몇 가지 메서드를 소개했다. 페이지 302

In [328]:
# 7.3.3 pandas의 벡터화된 문자열 함수

In [329]:
# 뒤죽박죽인 데이터를 분석을 위해 정리하는 일은 문자열을 다듬고 정규화하는 작업을 필요로 한다.

In [330]:
# 문자열을 담고 있는 컬럼에 누락된 값이 있다면 일을 더 복잡하게 만든다.

In [331]:
data = {"Dave": 'dave@google.com', "Steve": "steve@gmail.com",
        "Rob": "rob@gmail.com", "Wes": np.nan}

In [332]:
data = pd.Series(data)

In [333]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [334]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [335]:
# 문자열과 정규 표현식 메서드는 data.map을 사용해서 각 값에 적용(lambda 혹은 다른 함수를 넘겨서)할 수 있지만 NA 값을 만나면 실패하게 된다.

In [336]:
# 이런 문제에 대처하기 위해 Series에는 NA 값을 건너뛰도록 하는 간결한 문자열 처리 메서드가 있다.

In [337]:
# 이는 Series의 Str 속성을 이용하는데, 예를 들어 각 이메일 주소가 "gmail"을 포함하고 있는지 str.contains를 이용해서 검사할 수 있다.

In [338]:
data.str.contains("gmail")

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [339]:
# 정규 표현식을 IGNORECASE 같은 re 옵션과 함께 사용하는 것도 가능하다.

In [340]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [341]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [342]:
# 벡터화된 요소를 꺼내오는 몇 가지 방법이 있는데 str.get을 이용하거나 str 속성의 색인을 이용한다.

In [343]:
matches = data.str.match(pattern, flags=re.IGNORECASE)

In [344]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [345]:
# 내재된 리스트의 원소에 접근하기 위해서는 색인을 넘기면 된다.

In [348]:
data.str.get(1) # AttributeError: Can only use .str accessor with string values! 오류 발생, 임의로 수정

Dave       a
Steve      t
Rob        o
Wes      NaN
dtype: object

In [349]:
data.str[0] # AttributeError: Can only use .str accessor with string values! 오류 발생, 임의로 수정

Dave       d
Steve      s
Rob        r
Wes      NaN
dtype: object

In [ ]:
# 아래 문법으로 문자열을 잘라낼 수도 있다.

In [350]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [351]:
# [표7-5]에 pandas의 문자열 메서드를 정리해두었다. 페이지 305-306